#4-1. 시스템 구조 

![시스템 구조](http://postfiles14.naver.net/20160620_285/zzangis345_1466348872890CwTBC_PNG/1.png?type=w580)


___


#4-2. 시스템 기능

- 대중교통의 혼잡도 파악

- 최단 시간 경로 제시

- 대중교통을 조금  편리하게 이용 가능

___

#4-3. 시스템 구성요소


|종류  |설명  |기능  |입력  |출력  |예시  |
|-----|----|------|----|-----|------|
|NFC 기기|핸드폰과 같이 NFC칩이 내장되어 있는 도구|대중교통을 탈때 사용자에 대한 정보 제공||사용자에 대한 정보|교통카드, 유심칩|
|NFC 인식장치|NFC 칩을인식하고 전송할수 있는 장치|입력받은 사용자에대한 정보를 일시적으로 저장하고 일정주기마다 교통카드 서버로 전송|사용자에 대한 정보|사용자의 승 하차 장소|지하철 스크린도어, 버스 교통카드 단말기|
|교통카드 서버|교통카드 회사의 서버|교통카드를 사용한 사용자들의 정보를 전송받고 데이터베이스에 저장 후, 프로그램에서 정보를 요청할 경우 정보 전송|사용자의 승 하차 장소|사용자 정보|교통카드 회사 EX) 캐쉬비, 티머니|
|프로그램 서버|교통카드 서버로부터 정보를 전송받아 분류하는 메인 서버|전달받은 사용자들의 정보를 분류하고, 데이터베이스에 저장한 뒤에 사용자들이 프로그램을 사용할 때 분류한 정보를 전송|사용자 정보|사람분포도및 최단시간, 경로|프로그램|
|전자기기|프로그램 서버에서 정보를 받아 화면에 정보를 출력하는 기기|서버에서 전달받은 정보를 지도 혹은 음성을 통해 기기로 출력|사람 분포도 및 최단 시간, 경로|지도, 음성|휴대폰, 컴퓨터|


___

#4-4. 구성요소 간 동작 흐름

![구성요소 간 동작 흐름](http://postfiles9.naver.net/20160620_120/zzangis345_1466348873099rhLb5_PNG/2.PNG?type=w580)
